package pag_doc;

/**
 * Управляющие операторы,применяются для переходов и ветвлений в потоке
 * выполнения команд программы<br>Делятся на:операторы выбора(выбирать разные
 * ветви выполнения команд),операторы цикла(повторять выполнение одного или
 * нескольких операторов),операторы перехода(нелинейное выполнение
 * программ)<br>if-else-if<br>Условные выражения в такой конструкции вычисляются сверху вниз
 * Как только обнаружится истинное условие, выполняется связанный с ним
 * оператор, а все остальные операторы в многоступенчатой конструкции
 * опускаются, Если ни одно из условий не является истинным, то выполняется
 * последний оператор else, который зачастую играет роль условия,
 * устанавливаемого по умолчанию, Когда последний оператор else отсутствует,
 * а все остальные проверки по условию дают ложный результат, никаких действий
 * вообще не выполняется<br>
 *
 */
public class doc {

}
